Repository: 84000/data-translation-memory
Catalog: Toh_147-The_Teaching_on_the_Great_Compassion_of_the_Tathagata-v1.tmx
Source language: bo
Languages: en

source: གང་མཉམ་པས་བྱེད་པ་འདི་ནི་གནས་ཡིན་ཞིང་གོ་སྐབས་ཡོད་དོ། །
en: That he who is equal to the universal monarch will govern a kingdom is possible. This will happen.

source: གནས་མ་ཡིན་ཞིང་གོ་སྐབས་མེད་དེ། གང་བྱང་གི་སྒྲ་མི་སྙན་གྱི་མི་ལོག་པར་ལྟུང་བར་འགྲོ་བ་
en: “That a human being from the northern continent of Uttarakuru will descend to lower destinies is impossible.

source: བདེ་འགྲོར་འགྲོ་བ་ནི་གནས་ཡིན་ཞིང་གོ་སྐབས་ཡོད་དོ། །
en: That such a human will proceed to happy destinies is possible. This will happen.

source: གནས་མ་ཡིན་ཞིང་གོ་སྐབས་མེད་དེ། གང་སྲོག་གཅོད་པའི་སྐྱེ་དགུ་གང་ཟག་སྲོག་གཅོད་པའི་རྒྱུས་ཚེ་རིང་བར་འགྱུར་བ་ནས། ལོག་པར་ལྟ་བ་དག་ལོག་པར་ལྟ་བ་ཅན་ལོག་པའི་ལས་ཡང་དག་པར་བླངས་པའི་རྒྱུས་འཕགས་པའི་ལམ་འཐོབ་པར་འགྱུར་བའི་བར་
en: That individuals who kill will enjoy long lives on account of their killing and that they will attain the noble path on account of their wrong views and the wrongful deeds based on them is impossible.

source: འདི་ནི་གནས་ཡིན་ཞིང་གོ་སྐབས་ཡོད་དེ། གང་སྲོག་གཅོད་པ་སྤངས་པའི་རྒྱུས་ཚེ་རིང་བར་འགྱུར་བ་ནས། ཡང་དག་པར་ལྟ་བ་འཕགས་པའི་ལམ་འཐོབ་པར་འགྱུར་བའི་བར་
en: That someone with a long life on account of abandoning killing will attain the noble path through correct views is possible.

source: གནས་མ་ཡིན་ཞིང་གོ་སྐབས་མེད་དེ། གང་བརྒྱད་པ་འབྲས་བུ་མ་ཐོབ་པར་ལྡང་བ་
en: “That one will find deliverance without attaining the fruition of the eight paths is impossible.

source: གང་འབྲས་བུ་ཐོབ་ནས་ལྡང་བ་འདི་ནི་གནས་ཡིན་ཞིང་གོ་སྐབས་ཡོད་དོ། །
en: That one will find deliverance once one has attained their fruition is possible. This will happen.

source: གནས་མ་ཡིན་ཞིང་གོ་སྐབས་མེད་དེ། གང་རྒྱུན་དུ་ཞུགས་པ་སྲིད་པ་བརྒྱད་པ་མངོན་པར་འགྲུབ་པ་
en: That a stream enterer will actualize an eighth existence is impossible.

source: གང་རེ་ལྟར་ཐོགས་ཀྱང་སྲིད་པ་བདུན་དུ་འགྱུར་བ་འདི་ནི་གནས་ཡིན་ནོ། །
en: That a stream enterer will enter a seventh existence even though there are obstacles is possible.

source: གནས་མ་ཡིན་ཞིང་གོ་སྐབས་མེད་དེ། གང་ལན་ཅིག་ཕྱིར་འོང་བ་སྲིད་པ་གཉིས་པ་མངོན་པར་འགྲུབ་པ་
en: That a once-returner will actualize a second existence is impossible.

source: གང་ལན་ཅིག་ཕྱིར་འོང་བ་འཇིག་རྟེན་འདིར་འོངས་ནས་སྡུག་བསྔལ་མཐར་འབྱིན་པར་བྱེད་པ་འདི་ནི་གནས་ཡིན་ཞིང་གོ་སྐབས་ཡོད་དོ། །
en: That a once-returner will reach the end of suffering after having returned to this world is possible. This will happen.

source: གནས་མ་ཡིན་ཞིང་གོ་སྐབས་མེད་དེ། གང་ཕྱིར་མི་འོང་བ་འཇིག་རྟེན་འདིར་འོང་བ་
en: That a non-returner will return to this world is impossible.

source: གང་དེ་ཉིད་དུ་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་འདི་ནི་གནས་ཡིན་ཞིང་གོ་སྐབས་ཡོད་དོ། །
en: That a non-returner will transcend suffering completely is possible. This will happen.

source: གནས་མ་ཡིན་ཞིང་གོ་སྐབས་མེད་དེ། གང་དགྲ་བཅོམ་པ་ཉིང་མཚམས་སྦྱོར་བར་འགྱུར་བ་
en: That an arhat will enter a new existence is impossible.

source: གང་དགྲ་བཅོམ་པ་ཉིང་མཚམས་སྦྱོར་བ་མེད་པ་འདི་ནི་གནས་ཡིན་ཞིང་གོ་སྐབས་ཡོད་དོ། །
en: That an arhat will not enter a new existence is possible. This will happen.

source: གནས་མ་ཡིན་ཞིང་གོ་སྐབས་མེད་དེ། གང་འཕགས་པའི་གང་ཟག་སྟོན་པ་གཞན་གྱི་ལུང་ནོད་པ་
en: “That a noble being will accept the instructions of another teacher is impossible.

source: གང་ལྷ་གཞན་མེད་པ་འདི་ནི་གནས་ཡིན་ནོ། །གནས་མ་ཡིན་ཞིང་གོ་སྐབས་མེད་དེ།
en: That such a being will have no other deity is possible.

source: གང་མི་སྐྱེ་བའི་ཆོས་ལ་བཟོད་པ་རབ་ཏུ་ཐོབ་པའི་བྱང་ཆུབ་སེམས་དཔའ་ཕྱིར་ལྡོག་པར་འགྱུར་བ་
en: That a bodhisattva who accepts the unborn nature of phenomena will regress is impossible.

source: གང་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་འདི་ནི་གནས་ཡིན་ནོ། །
en: That such a bodhisattva will awaken to complete and perfect awakening is possible.

source: གནས་མ་ཡིན་ཞིང་གོ་སྐབས་མེད་དེ། གང་བྱང་ཆུབ་སེམས་དཔའ་བྱང་ཆུབ་ཀྱི་སྙིང་པོ་ལ་འདུག་ནས་མངོན་པར་རྫོགས་པར་སངས་མ་རྒྱས་པར་ལྡང་བ་
en: That a bodhisattva who dwells on the seat of awakening will arise without completely and perfectly awakening is impossible.

source: གང་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་ལྡང་བ་འདི་ནི་གནས་ཡིན་ནོ། །
en: That such a bodhisattva will arise as one awakened to complete and perfect awakening is possible.

source: གནས་མ་ཡིན་ཞིང་གོ་སྐབས་མེད་དེ། གང་དེ་བཞིན་གཤེགས་པ་ལ་བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བ་སྣང་བ་
en: “That karmic traces will appear for tathāgatas is impossible.

source: གང་དེ་བཞིན་གཤེགས་པ་བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བ་ཐམས་ཅད་ལེགས་པར་བཅོམ་པ་འདི་ནི་གནས་ཡིན་ཞིང་གོ་སྐབས་ཡོད་དོ། །
en: That tathāgatas will have destroyed all karmic traces is possible. This will happen.

source: གནས་མ་ཡིན་ཏེ། གང་དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་ཐོགས་པར་འགྱུར་བ་འདི་ནི་གནས་མེད་དོ། །
en: That the wisdom of tathāgatas will be obstructed is impossible.

source: གང་དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་ཐོགས་པ་མེད་པ་འདི་ནི་གནས་ཡིན་ནོ། །
en: That the wisdom of tathāgatas will be unobstructed is possible.

source: གནས་མ་ཡིན་ཞིང་གོ་སྐབས་མེད་དེ། གང་དེ་བཞིན་གཤེགས་པའི་སྤྱི་གཙུག་མཐོང་བར་འགྱུར་བ་
en: That the crown protuberances of tathāgatas will be visible is impossible.

source: གང་དེ་བཞིན་གཤེགས་པའི་སྤྱི་གཙུག་བལྟར་མི་མཐོང་བ་འདི་ནི་གནས་ཡིན་ནོ། །
en: That the crown protuberances of tathāgatas will be invisible is possible.

source: གནས་མ་ཡིན་ཞིང་གོ་སྐབས་མེད་དེ། གང་སངས་རྒྱས་ཀྱི་མཐུ་མ་གཏོགས་པར་དེ་བཞིན་གཤེགས་པའི་སེམས་ཀྱི་རྒྱུ་བ་ཤེས་པ་
en: That one will know the activity of tathāgatas’ minds through means other than the power of buddhas is impossible.

source: གང་མི་ཤེས་པ་འདི་ནི་གནས་ཡིན་ནོ། །
en: That one will not know it is possible.

source: གནས་མ་ཡིན་ཏེ། གང་དེ་བཞིན་གཤེགས་པ་ལ་སེམས་མཉམ་པར་མ་བཞག་པ་དམིགས་པ་འདི་ནི་གནས་མེད་དོ། །
en: That the minds of tathāgatas will not be in equipoise and will have reference points is impossible.

source: གང་དེ་བཞིན་གཤེགས་པ་རྟག་ཏུ་མཉམ་པར་གཞག་པ་འདི་ནི་གནས་ཡིན་ནོ། །
en: That tathāgatas will be in constant equipoise is possible.

source: འདི་ནི་གནས་མ་ཡིན་ཏེ། གང་དེ་བཞིན་གཤེགས་པ་ལ་ལོག་པའི་ཚིག་འབྱུང་བ་འདི་ནི་གནས་མ་ཡིན་ནོ། །
en: That untrue words will issue from tathāgatas is impossible.

source: གང་བདེན་པའི་ཚིག་འབྱུང་བ་འདི་ནི་གནས་ཡིན་ནོ། །
en: That true words will issue is possible.

source: རིགས་ཀྱི་བུ་གནས་མ་ཡིན་ཞིང་གོ་སྐབས་མེད་དེ། དེ་བཞིན་གཤེགས་པ་ལ་འཁྲུལ་པ་དམིགས་པ་
en: “Son of noble family, that deluded objective reference will exist for tathāgatas is impossible.

source: འདི་ནི་གནས་ཡིན་ཞིང་གོ་སྐབས་ཡོད་དེ། གང་དེ་བཞིན་གཤེགས་པ་ལ་འཁྲུལ་པ་མེད་པ་
en: That delusion will not exist for tathāgatas is possible.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་གང་དེ་བཞིན་གཤེགས་པའི་གནས་དང་གནས་མ་ཡིན་པར་མཁྱེན་པའི་སྟོབས་དེ་ཡི་གེ་རྣམས་ཀྱིས་ཚད་བསྟན་དུ་མེད་དེ་ཡང་དག་པའོ། །
en: Son of noble family, words cannot illustrate the scope of the Tathāgata’s power of knowing what is possible and what is impossible.

source: དེ་ཁོ་ནའོ། །
en: It is perfect.

source: གཞན་མ་ཡིན་པ་ཉིད་དོ། །
en: It is unique and like no other.

source: དེ་ལ་འདི་སྐད་ཅེས་བྱའོ། །
en: About this the following is proclaimed:

source: ས་ཀུན་འགྲུམ་པར་འགྱུར་ཡང་སྲིད། །
en: “ ‘All earth may crumble,

source: ནམ་མཁའ་གཡོ་བར་འགྱུར་སྲིད་ཀྱི། །
en: The sky may tremble,

source: སངས་རྒྱས་གནས་མིན་བཤད་པ་ནི། །
en: But for what the Buddha has explained not to be the case—

source: གནས་སུ་འགྱུར་བ་མི་སྲིད་དོ། །
en: That will never occur.

source: སྐྱེས་བུས་ཁ་དོག་ལྔ་ཅན་དུ། །ནམ་མཁའ་གཟུགས་སུ་བྱེད་ཀྱང་སྲིད། །
en: “ ‘Beings may mold space Into five-colored form,

source: ཐ་མ་དང་ནི་འབྲིང་དང་མཆོག །
en: To a lesser, middling, or supreme degree—

source: གང་དག་སངས་རྒྱས་གནས་བཤད་པ། །
en: “ ‘All that the Buddha has explained to be the case

source: དེ་ཀུན་དེ་བཞིན་བཤད་པ་སྟེ། །གཞན་དུ་འགྱུར་བ་ཡོད་མ་ཡིན། །
en: There is no way that any of that Will turn out to be otherwise.

source: གང་དག་གནས་མིན་བཤད་པ་ཡང་། །
en: “ ‘All that he has explained not to be the case

source: གནས་དང་གནས་མིན་རབ་ཤེས་པ། །སེམས་ཅན་བསམ་པ་ཇི་བཞིན་དུ། །དེས་ནི་ཕྱད་པར་ཡང་དག་དང་། །ཆོས་ཀྱང་སྲོག་ཆགས་རྣམས་ལ་བཤད། །
en: “ ‘He who knows what is and what is not the case Continuously explains the truth And the Dharma to creatures In accordance with their thoughts.

source: དགེ་སྦྱོང་དང་ནི་བྲམ་ཟེ་གཞན། །གང་དུ་ཐམས་ཅད་རྒྱུག་བྱེད་ཅིང་། །གནས་དང་གནས་མིན་མི་ཤེས་པ། །སངས་རྒྱས་ལ་ནི་དེ་མེད་དོ། །
en: “ ‘Other mendicants and brahmins Who rush around everywhere Do not know what is and what is not the case. That is not so for the Buddha.

source: གནས་གང་དང་ནི་ལྡན་པས་ན། །
en: “ ‘When endowed with what is possible,

source: སེམས་ཅན་ཐར་བྱེད་དཔུང་འགྱུར་བ། །
en: The liberation of beings will multiply.

source: ཡོན་ཏན་ཀུན་ལྡན་སངས་རྒྱས་ཀྱིས། །དེ་ནི་ཡང་དག་རབ་ཏུ་བཤད། །
en: The fully qualified Buddha Explains that precisely.

source: སེམས་ཅན་གང་དག་སྣོད་མིན་གང་། །དེ་ལ་སངས་རྒྱས་བཏང་སྙོམས་མཛད། །
en: “ ‘Toward beings who are not receptive, The Buddha remains in equanimity.

source: གང་གི་དུས་ན་འགྲོལ་འགྱུར་བ། །དེ་ཡི་དུས་ལ་རབ་ཏུ་གཞེས། །
en: He waits for the right occasion, The time at which to liberate them.

source: གང་གིས་སེམས་ཅན་ཐར་བྱེད་པ། །ཁ་ན་མ་ཐོ་མེད་པའི་ལས། །
en: “ ‘What liberates beings Is conduct beyond reproach.

source: སངས་རྒྱས་བློ་མཆོག་ལྡན་པ་ཡི། །འཕྲིན་ལས་དང་པོ་འདི་ཡིན་ནོ། །
en: That is the first liberating activity Of the supremely intelligent Buddha.

source: གནས་དང་གནས་མིན་བཤད་པ་ནི། །དཔག་ཏུ་མེད་ཅིང་གྲངས་མེད་དེ། །
en: “ ‘His explanations of what is and what is not the case Are unfathomable and innumerable.

source: དྲང་སྲོང་ཆེན་པོའི་སྟོབས་འདི་ནི། །ཕ་རོལ་རྒོལ་བས་ཐུབ་པར་དཀའ། །
en: This power of the great sage Is hard for adversaries to match.’

source: རིགས་ཀྱི་བུ་གཞན་ཡང་དེ་བཞིན་གཤེགས་པས་འདས་པ་དང་། མ་འོངས་པ་དང་། ད་ལྟར་བྱུང་བའི་ལས་རྣམས་དང་། ལས་ལེན་པ་རྣམས་གནས་དང་། རྒྱུ་དང་། དངོས་པོ་དང་། རྣམ་པར་སྨིན་པ་ལ་མཁས་བ་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་མཁྱེན་ཏོ། །
en: (2) “Son of noble family, tathāgatas know skillfully and in accordance with reality about past, present, and future actions as well as the basis, causes, substance, and maturation of the actions undertaken.

source: ཇི་ལྟར་རབ་ཏུ་མཁྱེན་ཅེ་ན།
en: You may ask, how do they understand them?

source: རིགས་ཀྱི་བུ་འདི་ལ་འདས་པའི་ལས་ལེན་པ་གང་དགེ་བའི་རྒྱུ་ལས་བྱུང་བ། མི་དགེ་བ་དང་བྲལ་བ། གང་མ་འོངས་པའི་དུས་ན་དགེ་བའི་རྒྱུ་ལས་བྱུང་བ་འབྱིན་པ་དེ་དེ་བཞིན་གཤེགས་པས་རབ་ཏུ་མཁྱེན་ཏོ། །
en: Son of noble family, the tathāgatas know the actions undertaken in the past that spring from virtuous causes, are free of anything nonvirtuous, and will, in the future, engender what springs from virtuous causes.

source: ལས་ལེན་པ་གང་མི་དགེ་བའི་རྒྱུ་ལས་བྱུང་བ། །དགེ་བ་དང་བྲལ་བ་གང་མ་འོངས་པའི་དུས་ན། མི་དགེ་བའི་རྒྱུ་ལས་བྱུང་བ་འབྱིན་པ་དེའང་དེ་བཞིན་གཤེགས་བས་རབ་ཏུ་མཁྱེན་ཏོ། །
en: They know the actions undertaken that spring from nonvirtuous causes, are free of anything virtuous, and will, in the future, engender what springs from nonvirtuous causes.

source: ལས་ལེན་པ་གང་མ་འོངས་པའི་དུས་ན་དམན་པ་ལ་བརྟེན་པར་འགྱུར་བ་དེའང་དེ་བཞིན་གཤེགས་པ་ས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་མཁྱེན་ཏོ། །ལས་ལེན་པ་གང་མ་འོངས་པའི་དུས་ན་ཁྱད་པར་ལ་བརྟེན་པར་འགྱུར་བ་དེའང་དེ་བཞིན་གཤེགས་པས་རབ་ཏུ་མཁྱེན་ཏོ། །ལས་ལེན་པ་གང་ད་ལྟར་བྱུང་བའི་དུས་ན་དམན་པ་ལ་རྟེན་ལ་མ་འོངས་པའི་དུས་ན་ཁྱད་པར་བརྟེན་པར་འགྱུར་བ་དེའང་དེ་བཞིན་གཤེགས་པས་རབ་ཏུ་མཁྱེན་ཏོ། །
en: They know in accordance with reality the actions undertaken that will become the basis for something minor in the future, the actions undertaken that will become the basis for something major in the future, the actions undertaken that are the basis for something minor in the present that will become the basis for something major in the future, and

source: ལས་ལེན་པ་གང་ད་ལྟར་བྱུང་བའི་དུས་ན་ཁྱད་པར་ལ་རྟེན་ལ་མ་འོངས་པའི་དུས་ན་དམན་པ་ལ་བརྟེན་པར་འགྱུར་བ་དེའང་དེ་བཞིན་གཤེགས་པས་རབ་ཏུ་མཁྱེན་ཏོ། །
en: the actions undertaken that are the basis for something major in the present that will become the basis for something minor in the future.

source: ལས་ལེན་པ་གང་ད་ལྟར་བྱུང་བའི་དུས་ན་ཡང་དམན་པ་ལ་རྟེན་ལ་མ་འོངས་པའི་དུས་ན་ཡང་དམན་པ་ལ་བརྟེན་པར་འགྱུར་བ་དེའང་དེ་བཞིན་གཤེགས་པས་རབ་ཏུ་མཁྱེན་ཏོ། །
en: They know the actions undertaken that are the basis for something minor in the present that will also become the basis for something minor in the future.

source: ལས་ལེན་པ་གང་ད་ལྟར་བྱུང་བའི་དུས་ན་ཡང་ཁྱད་པར་ལ་རྟེན་ལ་མ་འོངས་པའི་དུས་ན་ཡང་ཁྱད་པར་ལ་བརྟེན་པར་འགྱུར་བ་དེའང་དེ་བཞིན་གཤེགས་པས་རབ་ཏུ་མཁྱེན་ཏོ། །
en: They know the actions undertaken that are the basis for something major in the present that will also become the basis for something major in the future.

source: ལས་ལེན་པ་གང་འདས་པ་ན་སྦྱོར་བར་དམན་ལ་དེ་མ་འོངས་པའི་དུས་ན་རྒྱ་ཆེ་ཞིང་སྦྱོར་བ་རྒྱ་ཆེ་བར་འགྱུར་བ་དེའང་དེ་བཞིན་གཤེགས་པས་རབ་ཏུ་མཁྱེན་ཏོ། །
en: They know the actions undertaken that were a minor task in the past that will become something major and turn into a great success in the future.

source: ལས་ལེན་པ་གང་རྩོམ་པ་ཆུང་ལ་ཁྱད་པར་ཆེན་པོར་འགྱུར་བ་དང་།
en: They know the actions undertaken that require little exertion that may nonetheless become of great significance.

source: ལས་ལེན་པ་གང་རྩོམ་པ་ཆེན་པོར་འགྱུར་ལ་ཁྱད་པར་ཆུང་ངུར་འགྱུར་བ་དང་།
en: They also know the actions undertaken that require great exertion that may nonetheless become of little significance.

source: ལས་ལེན་པ་གང་ཉན་ཐོས་ཉིད་ཀྱི་རྒྱུ་འབྱིན་པ་དེའང་དེ་བཞིན་གཤེགས་པས་རབ་ཏུ་མཁྱེན་ཏོ། །ལས་ལེན་པ་གང་རང་སངས་རྒྱས་ཉིད་ཀྱི་རྒྱུ་འབྱིན་པ་དེའང་དེ་བཞིན་གཤེགས་པས་རབ་ཏུ་མཁྱེན་ཏོ། །ལས་ལེན་པ་གང་སངས་རྒྱས་ཉིད་ཀྱི་རྒྱུ་འབྱིན་པ་དེའང་དེ་བཞིན་གཤེགས་པས་རབ་ཏུ་མཁྱེན་ཏོ། །
en: “They know the actions undertaken that will engender the cause of śrāvakahood, the actions undertaken that will engender the cause of pratyekabuddhahood, and the actions undertaken that will engender the cause of buddhahood.

source: ལས་ལེན་པ་གང་ད་ལྟར་བྱུང་བ་ན་སྡུག་བསྔལ་ལ་མ་འོངས་པ་ན་རྣམ་པར་སྨིན་པ་བདེ་བར་འགྱུར་བ་དང་།
en: They know the actions undertaken that are painful at present but will lead to a blissful maturation in the future.

source: ལས་ལེན་པ་གང་ད་ལྟར་བྱུང་བ་ན་བདེ་བ་ལ་མ་འོངས་པ་ན་རྣམ་པར་སྨིན་པ་སྡུག་བསྔལ་བར་འགྱུར་བ་དང་།
en: They know the actions undertaken that are blissful at present but will lead to a painful maturation in the future.

source: ལས་ལེན་པ་གང་ད་ལྟར་བྱུང་བ་ན་སྡུག་བསྔལ་ལ་མ་འོངས་པ་ན་ཡང་རྣམ་པར་སྨིན་པ་སྡུག་བསྔལ་བར་འགྱུར་བ་དང་།
en: The tathāgatas know the actions undertaken that are painful at present and will also lead to a painful maturation in the future.

source: ལས་ལེན་པ་གང་ད་ལྟར་བྱུང་བ་ན་ཡང་བདེ་ལ་མ་འོངས་པ་ན་ཡང་རྣམ་པར་སྨིན་པ་བདེ་བར་འགྱུར་བ་དེ་ཡང་དེ་བཞིན་གཤེགས་པས་རབ་ཏུ་མཁྱེན་ཏོ། །
en: They know the actions undertaken that are blissful at present and will also lead to a blissful maturation in the future.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ན་འདས་པ་དང་། མ་འོངས་པ་དང་། ད་ལྟར་བྱུང་བའི་སེམས་ཅན་རྣམས་ཀྱི་ལས་གང་ཡིན་པ་དང་། རྐྱེན་གང་ཡིན་པ་དང་། རྣམ་པར་སྨིན་པ་གང་ཡིན་པ་དེ་དེ་བཞིན་གཤེགས་པས་དེ་ཁོ་ན་དང་། གཞན་མ་ཡིན་པ་ལ་རྟེན་པར་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་མཁྱེན་ཏོ། །
en: “In these ways, son of noble family, the tathāgatas uniquely and independently understand in accordance with reality all about beings’ actions in the past, present, and future, their circumstances, and their maturation.

source: མཁྱེན་ནས་ཀྱང་དེ་བཞིན་དུ་ཆོས་སྟོན་ཏེ།
en: With this understanding they teach the Dharma accordingly.

source: འདི་ནི་དེ་བཞིན་གཤེགས་པའི་དེ་བཞིན་གཤེགས་པའི་འཕྲིན་ལས་གཉིས་པའོ། །
en: This is the second tathāgata activity of the tathāgatas.

source: དེ་བཞིན་གཤེགས་པ་རྒྱུ་ལ་མཁས་པ་སྟེ། །
en: “ ‘The tathāgatas are skilled in causes.

source: ལས་ཀྱི་རྣམ་སྨིན་ཚུལ་མཁྱེན་སྤྱན་དང་ལྡན། །
en: They are endowed with the eye of knowing how actions mature.

source: དུས་གསུམ་དག་ལ་ཆགས་པ་མི་མངའ་སྟེ། །
en: Not fettered by the three times,

source: སེམས་ཅན་ཀུན་གྱི་སྤྱོད་པ་རབ་ཏུ་མཁྱེན། །
en: They know the conduct of all sentient beings.

source: རྒྱུ་ནི་གང་ཞིག་བདེ་བར་འགྱུར་བ་སྟེ། །
en: Which causes engender bliss,

source: ལྷ་དང་མི་ཡི་རྣམ་པར་སྨིན་ལྡན་དང་། །
en: Comprising maturation as gods and humans,

source: གང་ཡང་སྡུག་བསྔལ་དག་ཏུ་འགྱུར་བྱེད་པ། །
en: And which ones engender suffering.

source: དེ་ནི་བདེ་བར་གཤེགས་པས་རབ་ཏུ་མཁྱེན། །
en: “ ‘The sugatas know

source: དགེ་བ་དང་ནི་མི་དགེའི་ལས་རྣམས་ཀྱི། །
en: Of virtuous and nonvirtuous actions,

source: རྒྱུ་དང་རྣམ་པར་སྨིན་པ་ཅིར་འགྱུར་བ། །
en: The causes and the maturation

source: དེ་ནི་བདེ་བར་གཤེགས་པས་རབ་མཁྱེན་ཏེ། །
en: “ ‘The sugatas know

source: ནོར་བུ་རིན་ཆེན་ཕྱག་ཏུ་བཞག་པ་བཞིན། །
en: Like holding a precious jewel in their hands.

source: ལས་གང་ཆུང་ངུའི་རྒྱུ་ལས་བྱུང་གྱུར་ལ། །
en: “ ‘Which actions arise from tiny causes

source: ཚད་མེད་རྒྱུད་ཀྱང་འབྱིན་པར་འགྱུར་བ་དང་། །
en: And engender immeasurable consequences,

source: གང་ཡང་རྒྱ་ཆེ་བ་དང་ཆུང་ངུ་ཡང་། །
en: However vast or tiny they may be—

source: དེ་ནི་ཇི་ལྟ་བཞིན་དུ་སངས་རྒྱས་མཁྱེན། །
en: The buddhas know them all exactly.

source: གང་ཡང་ཉན་ཐོས་ཀྱི་ནི་རྒྱུ་འབྱིན་དང་། །
en: What leads to the Śrāvaka Vehicle,

source: རྐྱེན་གྱི་ཐེག་པ་དེ་བཞིན་འབྱིན་པ་དང་། །
en: What leads to the Pratyekabuddha Vehicle,

source: གང་ཡང་རྒྱལ་བའི་རྒྱུ་ནི་འབྱིན་འགྱུར་བ། །
en: And the causes of a victor.

source: དེ་ཀུན་བདེ་བར་གཤེགས་པས་རབ་ཏུ་མཁྱེན། །
en: “ ‘The sugatas know all about

source: རྒྱུ་ནི་གང་ཞིག་སྡུག་བསྔལ་འགྱུར་བྱེད་ལ། །དེ་ཡང་བདེ་བ་དག་ཏུ་འགྱུར་བ་དང་། །
en: “ ‘They know which causes are painful now But will later engender bliss;

source: རྒྱུ་ནི་གང་ཞིག་བདེ་བར་འགྱུར་བྱེད་ལ། །དེ་ཡང་སྡུག་བསྔལ་དག་ཏུ་འགྱུར་བ་དང་། །
en: Which causes are blissful now But will later engender pain;

source: རྒྱུ་ནི་བདེ་ལ་སྡུག་བསྔལ་གནས་པ་དང་། །
en: “ ‘Which causes are painful now and will be painful later;

source: རྒྱུ་ཡང་བདེ་ལ་བདེ་བར་གནས་པ་དང་། །
en: And which causes are blissful now and will be blissful later.

source: ལས་ཀྱི་ངོ་བོ་ཉིད་ཀྱི་ཆོས་ཉིད་ནི། །རྒྱུ་དང་འཐུན་པར་བདེ་གཤེགས་རབ་ཏུ་མཁྱེན། །
en: The sugatas thus know the true nature of actions

source: དུས་གསུམ་དག་ཏུ་སེམས་ཅན་ཐམས་ཅད་ཀྱི། །
en: By all beings of the three times,

source: རྒྱུ་གང་ལས་འཇུག་བྱེད་དང་ལས་ཀྱང་ནི། །གཞན་མ་ཡིན་པར་སངས་རྒྱས་ཡེ་ཤེས་ཀྱིས། །
en: In accordance with their causes. “ ‘With their unique buddha wisdom Of actions and the causes for their engagement

source: དེ་བཞིན་རྒྱལ་བས་ཕྱད་པར་རབ་ཏུ་མཁྱེན། །
en: The victors always know this just as it is.’

source: རིགས་ཀྱི་བུ་གཞན་ཡང་དེ་བཞིན་གཤེགས་པས་སེམས་ཅན་གཞན་རྣམས་དང་། གང་ཟག་གཞན་དག་གི་མོས་པ་དུ་མ་དང་། མོས་པ་སྣ་ཚོགས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་མཁྱེན་ཏོ། །
en: (3) “Son of noble family, the tathāgatas know in accordance with reality the many and various inclinations of other beings and individuals.

source: རིགས་ཀྱི་བུ་དེ་བཞིན་གཤེགས་པས་སེམས་ཅན་གཞན་དག་དང་། གང་ཟག་གཞན་རྣམས་ཀྱི་མོས་པ་དུ་མ་དང་། མོས་པ་སྣ་ཚོགས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་ཇི་ལྟར་རབ་ཏུ་མཁྱེན་ཅེ་ན
en: You may ask, how do they know in accordance with reality the many and various inclinations of other beings and individuals?

source: གང་ཟག་གང་འདོད་ཆགས་ལ་གནས་ཤིང་ཞེ་སྡང་ལ་མོས་པ་དང་། གང་ཟག་གང་ཞེ་སྡང་ལ་གནས་ཤིང་འདོད་ཆགས་ལ་མོས་པ་དང་། གང་ཟག་གང་གཏི་མུག་ལ་གནས་ཤིང་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་ལ་མོས་པ་དེ་ཡང་དེ་བཞིན་གཤེགས་པས་རབ་ཏུ་མཁྱེན་ཏོ། །
en: They know which individuals are established in attachment and inclined toward aversion, which individuals are established in aversion and inclined toward attachment, and which individuals are established in delusion and inclined toward attachment, aversion, and delusion.

source: གང་ཟག་གང་དགེ་བ་ལ་གནས་ཤིང་དགེ་བ་ལ་མོས་པ་དེ་ཡང་དེ་བཞིན་གཤེགས་པས་རབ་ཏུ་མཁྱེན་ཏོ། །གང་ཟག་གང་དག་སྦྱོར་བ་དམན་ཞིང་བསམ་པ་རྒྱ་ཆེན་པོ་ལ་མོས་པ་དེ་དག་ཀྱང་དེ་བཞིན་གཤེགས་པས་རབ་ཏུ་མཁྱེན་ཏོ། །གང་ཟག་གང་དག་སྦྱོར་བ་རྒྱ་ཆེ་ཞིང་བསམ་པ་དམན་པ་ལ་མོས་པ་དེ་དག་ཀྱང་དེ་བཞིན་གཤེགས་པས་རབ་ཏུ་མཁྱེན་ཏོ། །
en: The tathāgatas know which individuals are established in virtue and inclined toward virtue, which individuals whose engagement is minor are inclined with a vast intention, and which individuals whose engagement is vast are inclined with a minor intention.

source: མོས་པ་གང་གིས་སྦྱོར་བ་དམན་ཞིང་ཁྱད་པར་ལ་གནས་པར་འགྱུར་བ་དང་། མོས་པ་གང་གིས་སྦྱོར་བ་ཁྱད་པར་དུ་འཕགས་ཤིང་དམན་པ་ལ་གནས་པར་འགྱུར་བ་དང་།
en: They know which inclinations will transform minor engagements into major ones and which inclinations will transform superior engagements into minor ones.

source: མོས་པ་གང་གིས་ལོག་པ་ཉིད་དུ་ངེས་ལ་ངེས་པའི་ཁམས་ཐོབ་པར་འགྱུར་བ་དང་། མོས་པ་གང་གིས་མ་ངེས་ལ་ཡང་དག་པ་ཉིད་དུ་ངེས་པའི་ཁམས་ཐོབ་པར་འགྱུར་བ་དང་། མོས་པ་གང་གིས་ཡང་དག་པ་ཉིད་དུ་ངེས་ལ་རྣམ་པར་གྲོལ་བ་ཐོབ་པར་འགྱུར་བ་དེ་ཡང་དེ་བཞིན་གཤེགས་པས་ཡང་དག་པ་ཇི་ལྟ་བ་བཞིན་དུ་རབ་ཏུ་མཁྱེན་ཏོ། །
en: They know in accordance with reality which inclinations lead to acquiring a determined disposition that is destined for error, which inclinations remain undetermined, which inclinations lead to acquiring a disposition that is destined for truth, and which inclinations lead to attaining liberation in the case of one destined for truth.

source: མོས་པ་གང་གིས་འདོད་པའི་ཁམས་ལས་ཡང་དག་པར་འདའ་བར་འགྱུར་བ་དང་། མོས་པ་གང་གིས་གཟུགས་ཀྱི་ཁམས་ལས་ཡང་དག་པར་འདའ་བར་འགྱུར་བ་དང་། མོས་པ་གང་གིས་ཁམས་གསུམ་པ་ལས་ཡང་དག་པར་འདའ་བར་འགྱུར་བ་དེ་ཡང་དེ་བཞིན་གཤེགས་པས་རབ་ཏུ་མཁྱེན་ཏོ། །
en: They know which inclinations will lead beyond the desire realm, which will lead beyond the form realm, and which will lead beyond the third realm.

source: མོས་པ་གང་གིས་དམན་པ་ལ་སྟེན་ཅིང་ཁྱད་པར་གནོན་པར་འགྱུར་བ་དང་། མོས་པ་གང་གིས་ཁྱད་པར་དུ་གྱུར་ནས་ཀྱང་དམན་པ་ལ་གནས་པར་འགྱུར་བ་དེ་ཡང་དེ་བཞིན་གཤེགས་པས་རབ་ཏུ་མཁྱེན་ཏོ། །
en: They know which inclinations will suppress something major through relying on something minor and which inclinations will transform something major into something minor.

source: མོས་པ་གང་གིས་སྐྱེ་བ་ཐ་དད་པ་དང་། ཁ་དོག་ཐ་དད་པ་དང་། ཡོངས་སུ་ལོངས་སྤྱོད་པ་ཐ་དད་པ་ཡོངས་སུ་འཛིན་པར་འགྱུར་བ་དེའང་དེ་བཞིན་གཤེགས་པས་རབ་ཏུ་མཁྱེན་ཏོ། །
en: They know which inclinations will bring about the attainment of varying kinds of corresponding birth, appearance, and means of livelihood.

source: མོས་པ་གང་གིས་རྩེ་མོ་ལས་ཉམས་པར་འགྱུར་བ་དང་། མོས་པ་གང་གིས་རྣམ་པར་གྲོལ་བ་ཐོབ་པར་འགྱུར་བ་དེའང་དེ་བཞིན་གཤེགས་པས་རབ་ཏུ་མཁྱེན་ཏོ། །
en: The tathāgatas know which inclinations will lead to downfall from the peak of existence and which inclinations will lead to the attainment of liberation.

source: མཁྱེན་ནས་ཀྱང་དེ་བཞིན་དུ་ཆོས་སྟོན་ཏོ། །
en: With this understanding they teach the Dharma accordingly.

source: འདི་ནི་དེ་བཞིན་གཤེགས་པའི་དེ་བཞིན་གཤེགས་པའི་འཕྲིན་ལས་གསུམ་པའོ། །
en: This is the third tathāgata activity of the tathāgatas.

source: འཇིག་རྟེན་མོས་པ་སྣ་ཚོགས་མོས་པ་དུ་མར་བློ་གྲོས་ཚད་མེད་པ། །
en: “ ‘With their limitless intelligence, the tathāgatas know the entire range

source: དེ་ཡི་མོས་པ་དེ་བཞིན་གཤེགས་པས་ལྷག་མ་མ་ལུས་མཁྱེན་པར་གྱུར། །
en: Of the world’s various and manifold inclinations.

source: འདི་ན་གང་གི་མོས་པ་ཞེ་སྡང་རྒྱུས་བྱུང་འདོད་ཆགས་གནས་པ་དང་། །
en: The buddhas know well which inclinations are caused by aversion and instill attachment

source: ཞེ་སྡང་གནས་ཤིང་གཏི་མུག་མོས་པ་སངས་རྒྱས་ཀྱིས་ནི་རབ་ཏུ་མཁྱེན། །
en: And which ones instill aversion and incline toward delusion.

source: གཏི་མུག་གནས་པའི་སེམས་ནི་དགེ་དང་འདོད་ཆགས་ལ་ཡང་འཇུག་པ་དང་། །
en: “ ‘With minds established in delusion, beings may engage in virtue or attachment.

source: དེའི་འོག་གང་འཇུག་པ་དང་སེམས་ཅན་སྦྱོར་བ་དམན་ལ་རྒྱ་ཆེན་མོས། །
en: Whichever is the case, it may be with minor engagement but a vast inclination.

source: བསམ་པ་རྒྱ་ཆེ་བ་དང་གང་དག་སྦྱོར་བ་རྒྱ་ཆེན་ཡོད་ཀྱང་ནི། །མོས་པ་དམན་པར་གྱུར་པ་
en: Even when there is vast intent and vast engagement, Inclination may transform it into something minor.

source: དེ་ཡང་བདེ་བར་གཤེགས་པས་རབ་ཏུ་མཁྱེན། །
en: This the sugatas know.

source: མོས་པ་གང་གིས་སེམས་ཅན་སྦྱོར་བ་དམན་ལ་རྒྱ་ཆེར་འགྱུར་བ་དང་། །
en: “ ‘The buddhas know which inclinations will transform a being’s minor engagement into something vast

source: སེམས་ཅན་བློ་གྲོས་རྒྱ་ཆེན་འགྱུར་ལ་དམན་པར་འགྱུར་བ་དེ་ཡང་མཁྱེན། །
en: And a being’s vast intelligence into something minor.

source: ལོག་པ་ཉིད་དུ་གང་ངེས་པ་ཡང་ཡང་དག་ཉིད་དུ་ངེས་འགྱུར་དང་། །
en: They know which inclinations are destined for error,

source: ཁམས་གསུམ་པ་ལས་རྣམ་པར་གྲོལ་བའི་མོས་པའང་སངས་རྒྱས་རབ་ཏུ་མཁྱེན། །
en: Which for the truth, and which for liberation from the three realms.

source: དུས་གསུམ་ཐམས་ཅད་དག་གི་སེམས་ཅན་ཀུན་གྱི་སྐྱེ་དང་ཁ་དོག་དང་། །དེ་བཞིན་ལོངས་སྤྱོད་ཐ་དད་པ་དང་
en: “ ‘The victors know well which inclinations bring about which births, appearances, And means of livelihood of all sentient beings of all the three times,

source: རྩེ་མོ་ལས་ནི་ཉམས་འགྱུར་དང་། །གང་ཡང་རྣམ་པར་གྲོལ་བར་འགྱུར་བའི་མོས་པ་རྒྱལ་བས་ཐམས་ཅད་མཁྱེན། །
en: Which bring downfall from the peak of existence, and which bring liberation.
